*

*打印EBCDIC/ASCII代码页,注意前者为256字符,后者为128.

*

 IDENTIFICATION DIVISION.

 PROGRAM-ID.    TESTPRG.

*

 ENVIRONMENT DIVISION.

 CONFIGURATION SECTION.

 SOURCE-COMPUTER. ES9000 WITH DEBUGGING MODE.

 OBJECT-COMPUTER. ES9000

 SEQUENCE OK-ASCII.

 SPECIAL-NAMES.

 ALPHABET OK-ASCII IS STANDARD-1

 CURRENCY IS  '$'.

 DATA DIVISION.

 WORKING-STORAGE SECTION.

 77 A              PIC A.

 77 TMP            PIC 999.

 77 I              PIC 999.

 PROCEDURE DIVISION.

D    DISPLAY 'BEGINNING OF EXEC...'.

*    TOO MANY CYCLINGS FOR ASCII.

    

     PERFORM VARYING I FROM 1 BY 1 UNTIL I > 64

         COMPUTE TMP = I * 4 - 3

         MOVE FUNCTION CHAR(TMP) TO A

         DISPLAY TMP, '    ', A

         COMPUTE TMP = I * 4 - 2

         MOVE FUNCTION CHAR(TMP) TO A

         DISPLAY TMP, '    ', A

         COMPUTE TMP = I * 4 - 1

         MOVE FUNCTION CHAR(TMP) TO A

         DISPLAY TMP, '    ', A

         COMPUTE TMP = I * 4

         MOVE FUNCTION CHAR(TMP)     TO A

         DISPLAY TMP, '    ', A

     END-PERFORM.



D    DISPLAY 'END OF EXEC...'.

     STOP RUN.

 END PROGRAM TESTPRG.